Repository: Keddnyo/miyolla
Catalog: lib/core/app/localization/app_*.arb
Languages: be, de, fr, ru, uk, zh

# appDescription
source: Firmwares for Huami wearables
be: Прашыўкі для носных прылад Huami
de: Firmwares f端r Huami Wearables
fr: Firmwares pour appareils portables Huami
ru: Прошивки для устройств Huami
uk: Прошивки для носіїв Huami
zh: 华米可穿戴设备固件

source: App developer
be: Распрацоўшчык прыкладанняў
de: App-Entwickler
fr: Développeur d'applications
ru: Разработчик приложения
uk: Розробник програми
zh: 应用开发者

# apiDeveloper
source: Back-End API developer
be: Распрацоўшчык Back-End API
de: Back-End-API-Entwickler
fr: Développeur d'API back-end
ru: Back-End API разработчик
uk: Розробник Back-End API
zh: 后端API开发人员

# firmwareLatestMsg
source: This firmware is up to date
be: Гэта прашыўка актуальная
de: Diese Firmware ist aktuell
fr: Ce firmware est à jour
ru: Актуальная прошивка
uk: Ця прошивка остання
zh: 这个固件是最新的

# firmwareUnsuitableMsg
source: The preferred language isn't supported
be: Пажаданая мова не падтрымліваецца
de: Die bevorzugte Sprache wird nicht unterst端tzt
fr: La langue préférée n'est pas prise en charge
ru: Прошивка не поддерживает нужный язык
uk: Бажана мова не підтримується
zh: 不支持首选语言

# firmwareDownloadMsg
source: Downloading firmware: {firmwareVersion}
be: Загрузка прашыўкі: {firmwareVersion}
de: Firmware wird heruntergeladen: {firmwareVersion}
fr: Téléchargement du micrologiciel: {firmwareVersion}
ru: Загрузка прошивки: {firmwareVersion}
uk: Завантаження прошивки: {firmwareVersion}
zh: 下载固件：{firmwareVersion}

# firmwareLoadingErrorMsg
source: Firmwares are unavailable
be: Спіс прашывак часова недаступен
de: Firmwares sind nicht verf端gbar
fr: Les micrologiciels ne sont pas disponibles
ru: Список прошивок временно недоступен
uk: Список прошивок тимчасово недоступний
zh: 固件不可用

source: Retry
be: Паўтарыць
de: Wiederholen
fr: Juger à nouveau
ru: Повторить
uk: Повторіть спробу
zh: 重试

# navigationErrorMsg
source: Page not found
be: Старонка не знойдзена
de: Seite nicht gefunden
fr: Page non trouvée
ru: Страница не найдена
uk: Сторінку не знайдено
zh: 找不到网页

# navigateBack
source: Go back
be: Вярнуцца назад
de: Geh zur端ck
fr: Retourner
ru: Вернуться назад
uk: Повернутися назад
zh: 回去
