Repository: Keddnyo/miyolla
Catalog: lib/l10n/app_*.arb
Languages: uk

# appDescription
source: All-in-one tool for Huami wearables
uk: Універсальний інструмент для носіїв Huami

# feedTitle
source: Feed
uk: Прошивки

# dialsTitle
source: Dials
uk: Циферблати

# appsTitle
source: Apps
uk: Програми

# aboutTitle
source: About
uk: Про додаток

# aboutText
source: This app is designed for Huami wearables. There are three destinations can be found in navigation drawer. The first one is firmwares feed. There you can download firmwares for different wearables. The second one is dials. There you can discover varius watch faces. The third one is apps. There you can find an Android app for your wearable.
uk: MiYolla — це агрегатор вмісту для носіїв Xiaomi. Доступно 3 категорії. Перша категорія — це стрічка мікропрограм для носіїв. Друга категорія — циферблати носіїв. Третя категорія — каталог додатків Android для взаємодії з носіями.

# appCredits
source: (c) Created by {developer}, 2023
uk: Створено {developer}, 2023

# firmwareReleaseNotes
source: Release notes:
uk: Примітки до випуску:

# firmwareDownload
source: Download
uk: Завантажити

source: Resource
uk: Ресурсs

source: Base resource
uk: Базові ресурси

source: Font
uk: Шрифт
